In [38]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

Why remove duplicates?
- To maintain accurate, consistent datasets
- To avoid producing erroneous or misleading statistics

In [39]:
DF_object = DataFrame({'column 1': [1, 1, 2, 2, 3, 3, 3],
                       'column 2': ['a', 'a', 'b', 'b', 'c', 'c', 'c'],
                       'column 3': ['A', 'A', 'B', 'B', 'C', 'C', 'C']})

DF_object

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

The method duplicated() gives true if all the elements of a certain row are the same as the elements of the row above.

In [40]:
DF_object.duplicated() # Returns if a row is a replica of the row above (all the elements)

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

Drop duplicates to drop the rows that contain replicated values

In [41]:
DF_object.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

Drop replicated values based on columns

In [42]:
DF_object = DataFrame({'column 1': [1, 1, 2, 2, 3, 3, 3],
                       'column 2': ['a', 'a', 'b', 'b', 'c', 'c', 'c'],
                       'column 3': ['A', 'A', 'B', 'B', 'C', 'D', 'C']})

DF_object

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        D
6         3        c        C

In [43]:
DF_object.drop_duplicates(['column 3']) # drop rows that have duplicates in 'column 3'

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C
5         3        c        D

In [44]:
DF_object

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        D
6         3        c        C

In [45]:
DF_object.drop_duplicates(['column 1']) # drop rows that have duplicates in 'column 1'

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

In [46]:
DF_object.drop_duplicates(['column 2']) # drop rows that have duplicates in 'column 2'

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C